## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.aws_s3_bucket_notification.default will be updated in-place
  ~ resource "aws_s3_bucket_notification" "default" {
        id          = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
        # (2 unchanged attributes hidden)

      ~ lambda_function {
          ~ filter_suffix       = "/ffis/raw.eml" -> "/grants.gov/extract.xml"
            id                  = "tf-s3-lambda-20230428182841935700000003"
          ~ lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload" -> "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB"
            # (2 unchanged attributes hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-28T21:09:28.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:23" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:23/invocations" -> (known after apply)
      ~ s3_key                         = "builds/d4a1c415495e110cd126d0c732354749a953e76e1f10a6da57d432812e4914d9.zip" -> "builds/b78c3bf83a9ecbab3ddd62d584de689440c4e82a576b0145d73a43022eb1cadd.zip"
      ~ s3_object_version              = "29ai08ASKrMzMQCi2quvIbYjS3W6ct1i" -> (known after apply)
        tags                           = {}
      ~ version                        = "23" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:f0bd8056f8c6ae696e2e2a97517bfd8919c250fb,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:6c53d1bc9d6cd92f33582b7ce1509e15e1453744,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "f0bd8056f8c6ae696e2e2a97517bfd8919c250fb" -> "6c53d1bc9d6cd92f33582b7ce1509e15e1453744"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "23" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "702f3db2f94886c8c3e9ef2c0bb148ad-2" -> (known after apply)
      ~ id                     = "builds/d4a1c415495e110cd126d0c732354749a953e76e1f10a6da57d432812e4914d9.zip" -> (known after apply)
      ~ key                    = "builds/d4a1c415495e110cd126d0c732354749a953e76e1f10a6da57d432812e4914d9.zip" -> "builds/b78c3bf83a9ecbab3ddd62d584de689440c4e82a576b0145d73a43022eb1cadd.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/d4a1c415495e110cd126d0c732354749a953e76e1f10a6da57d432812e4914d9.zip" -> "builds/b78c3bf83a9ecbab3ddd62d584de689440c4e82a576b0145d73a43022eb1cadd.zip"
-       tags                   = {} -> null
      ~ version_id             = "29ai08ASKrMzMQCi2quvIbYjS3W6ct1i" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/b78c3bf83a9ecbab3ddd62d584de689440c4e82a576b0145d73a43022eb1cadd.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/b78c3bf83a9ecbab3ddd62d584de689440c4e82a576b0145d73a43022eb1cadd.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4211824862424349455" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/d4a1c415495e110cd126d0c732354749a953e76e1f10a6da57d432812e4914d9.zip" -> "builds/b78c3bf83a9ecbab3ddd62d584de689440c4e82a576b0145d73a43022eb1cadd.zip"
          ~ "timestamp" = "1682716134555209000" -> "1682719271329039000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5756229383525522289" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/d4a1c415495e110cd126d0c732354749a953e76e1f10a6da57d432812e4914d9.zip" -> "builds/b78c3bf83a9ecbab3ddd62d584de689440c4e82a576b0145d73a43022eb1cadd.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-04-28T21:09:27.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:3/invocations" -> (known after apply)
      ~ s3_key                         = "builds/139fabfd84073b1ac0525c07cafdbbf814807096f2ff1b452bc85158aa80f036.zip" -> "builds/0b5145be7983954be1f773f2eeb1d9ed6799458997187511bbc6ae870fef0a90.zip"
      ~ s3_object_version              = "c1yTFoAqdea5_oGrn3Vc761leNAnYQpi" -> (known after apply)
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:f0bd8056f8c6ae696e2e2a97517bfd8919c250fb,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:6c53d1bc9d6cd92f33582b7ce1509e15e1453744,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "f0bd8056f8c6ae696e2e2a97517bfd8919c250fb" -> "6c53d1bc9d6cd92f33582b7ce1509e15e1453744"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "3" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1b00748bef03fa160735a5ca84d7064d-2" -> (known after apply)
      ~ id                     = "builds/139fabfd84073b1ac0525c07cafdbbf814807096f2ff1b452bc85158aa80f036.zip" -> (known after apply)
      ~ key                    = "builds/139fabfd84073b1ac0525c07cafdbbf814807096f2ff1b452bc85158aa80f036.zip" -> "builds/0b5145be7983954be1f773f2eeb1d9ed6799458997187511bbc6ae870fef0a90.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/139fabfd84073b1ac0525c07cafdbbf814807096f2ff1b452bc85158aa80f036.zip" -> "builds/0b5145be7983954be1f773f2eeb1d9ed6799458997187511bbc6ae870fef0a90.zip"
-       tags                   = {} -> null
      ~ version_id             = "c1yTFoAqdea5_oGrn3Vc761leNAnYQpi" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/0b5145be7983954be1f773f2eeb1d9ed6799458997187511bbc6ae870fef0a90.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/0b5145be7983954be1f773f2eeb1d9ed6799458997187511bbc6ae870fef0a90.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "223737419847953167" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/139fabfd84073b1ac0525c07cafdbbf814807096f2ff1b452bc85158aa80f036.zip" -> "builds/0b5145be7983954be1f773f2eeb1d9ed6799458997187511bbc6ae870fef0a90.zip"
          ~ "timestamp" = "1682716149236984000" -> "1682719286521921000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6637257421826071536" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/139fabfd84073b1ac0525c07cafdbbf814807096f2ff1b452bc85158aa80f036.zip" -> "builds/0b5145be7983954be1f773f2eeb1d9ed6799458997187511bbc6ae870fef0a90.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-28T21:09:27.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:22" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:22/invocations" -> (known after apply)
      ~ s3_key                         = "builds/9fe2df2542ed2caa5e616d2f010fa3750ea2414a623d61193f6237895e5f7482.zip" -> "builds/12dbe2599f24301b9d69ecb5d126e8ac33445ce1707f836c0045a431c480fabe.zip"
      ~ s3_object_version              = "6oByOzEtTNHnxP.GjEDiXTp_nkGpqQ7P" -> (known after apply)
        tags                           = {}
      ~ version                        = "22" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:f0bd8056f8c6ae696e2e2a97517bfd8919c250fb,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:6c53d1bc9d6cd92f33582b7ce1509e15e1453744,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "f0bd8056f8c6ae696e2e2a97517bfd8919c250fb" -> "6c53d1bc9d6cd92f33582b7ce1509e15e1453744"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "22" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e1df47a11a1a0fa096c464939bd4b2af-2" -> (known after apply)
      ~ id                     = "builds/9fe2df2542ed2caa5e616d2f010fa3750ea2414a623d61193f6237895e5f7482.zip" -> (known after apply)
      ~ key                    = "builds/9fe2df2542ed2caa5e616d2f010fa3750ea2414a623d61193f6237895e5f7482.zip" -> "builds/12dbe2599f24301b9d69ecb5d126e8ac33445ce1707f836c0045a431c480fabe.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/9fe2df2542ed2caa5e616d2f010fa3750ea2414a623d61193f6237895e5f7482.zip" -> "builds/12dbe2599f24301b9d69ecb5d126e8ac33445ce1707f836c0045a431c480fabe.zip"
-       tags                   = {} -> null
      ~ version_id             = "6oByOzEtTNHnxP.GjEDiXTp_nkGpqQ7P" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/12dbe2599f24301b9d69ecb5d126e8ac33445ce1707f836c0045a431c480fabe.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/12dbe2599f24301b9d69ecb5d126e8ac33445ce1707f836c0045a431c480fabe.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "141105692188550816" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9fe2df2542ed2caa5e616d2f010fa3750ea2414a623d61193f6237895e5f7482.zip" -> "builds/12dbe2599f24301b9d69ecb5d126e8ac33445ce1707f836c0045a431c480fabe.zip"
          ~ "timestamp" = "1682716134525099000" -> "1682719271601957000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3593781355942352865" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/9fe2df2542ed2caa5e616d2f010fa3750ea2414a623d61193f6237895e5f7482.zip" -> "builds/12dbe2599f24301b9d69ecb5d126e8ac33445ce1707f836c0045a431c480fabe.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 15 to add, 8 to change, 12 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4835106850)*